# ======================================================================================#
# =================| Общие настройки модулей |==========================================#
# ======================================================================================#

proxy = "btxt0P:LMCzDn@45.92.246.192:8000"  # user:pass@host:port

RETRY = 3  # кол-во попыток при ошибках/фейлах

THREAD = 4  # кол-во потоков


# если газ за транзу с этой сети будет выше в $, тогда скрипт будет спать 30с и пробовать снова
CHECK_GASS = True

MAX_GAS_CHARGE = {
    'ethereum': 5,
    'zora': 1

}

CHECK_GWEI = True  # перед работай чекает GWEI, если выше ожидаем GWEI

GWEI = 50

# ======================================================================================#
# =================|  Creating a route |========================================================#
# ======================================================================================#
# Составление маршрута скрипта
# Все настройки ниже

# OKX - вывод ETH с OKX

# Mint_Fun - Минт Passa и дальнейшая авторизая на сайте для создания очков (https://mint.fun/)

# Zora_Bridge - Основной бридж сети Zora (https://bridge.zora.energy/)

# Zora_NFT - Минт нфт зора по мере их появления будут добавляться(которые мы минтим на данный момент ниже в конифге)

Route = ['Zora_NFT']






# ======================================================================================#
# =================|  Mint_Fun |========================================================#
# ======================================================================================#

Refferel = ''  # address referal


# ======================================================================================#
# =================|  OKX |========================================================#
# ======================================================================================#


OKX_api_key = ''
OKX_secret_key = ''
OKX_password = ''

OKX_ETH = [0.01, 0.01]  # Вывод ETH в сеть эфира( ETH ERC20 min 0.01 ETH)


# ======================================================================================#
# =================| Zora_Bridge |========================================================#
# ======================================================================================#

Value_bridge = [0.005, 0.005]  # объём бриджа в эфире (всё не выводим оствляем на комсу)


# ======================================================================================#
# =================| Zora_NFT |========================================================#
# ======================================================================================#
amount = 10  # сколько новых нфт за раз минтить


